<template>
    <MainLayout>
        <div
            class="flex flex-col items-center gap-5 text-center md:gap-8 lg:gap-10"
        >
            <h1 class="contact-section text-center text-[19px] font-bold text-white uppercase">
                Контакты
            </h1>
            <div class="contact-section flex flex-col gap-2.5">
                <h1 class="text-[16px]/[16px] font-bold text-white uppercase">
                    О нас
                </h1>
                <p class="text-[14px]/[25px] font-medium text-TextGray">
                    Rust Resort - проект игровых серверов Rust. Открытие
                    состоялось 5 Января 2023 года
                </p>
            </div>
            <div class="contact-section flex flex-col gap-2.5">
                <h1 class="text-[16px]/[16px] font-bold text-white uppercase">
                    Наша почта
                </h1>
                <p class="text-[14px]/[25px] font-medium text-TextGray">
                    rustresort@gmail.com
                </p>
            </div>
            <div class="contact-section flex flex-col gap-2.5">
                <h1 class="text-[16px]/[16px] font-bold text-white uppercase">
                    Наши соцсети
                </h1>
                <div class="flex items-center justify-center gap-2.5">
                    <a
                        href="#"
                        class="fill-[#636363] duration-300 ease-in-out hover:fill-[#c4302b]"
                    >
                        <svg
                            xmlns="http://www.w3.org/2000/svg"
                            width="20"
                            height="14"
                            viewBox="0 0 20 14"
                        >
                            <path
                                fill-rule="evenodd"
                                clip-rule="evenodd"
                                d="M19.8 3.01985C19.8 3.01985 19.6044 1.6482 19.005 1.04429C18.2444 0.25123 17.3919 0.247524 17.0013 0.201509C14.2025 5.21541e-08 10.0044 0 10.0044 0H9.99563C9.99563 0 5.7975 5.21541e-08 2.99875 0.201509C2.6075 0.247524 1.75563 0.25123 0.994375 1.04429C0.395 1.64836 0.2 3.01985 0.2 3.01985C0.2 3.01985 0 4.631 0 6.24137V7.75168C0 9.36267 0.2 10.9732 0.2 10.9732C0.2 10.9732 0.395 12.3448 0.994375 12.9488C1.75563 13.7418 2.755 13.717 3.2 13.7997C4.8 13.9527 10 14 10 14C10 14 14.2025 13.9938 17.0013 13.7923C17.3919 13.7457 18.2444 13.742 19.005 12.9489C19.6044 12.3448 19.8 10.9734 19.8 10.9734C19.8 10.9734 20 9.36283 20 7.75168V6.24137C20 4.631 19.8 3.01985 19.8 3.01985ZM7.935 9.58178L7.93438 3.9891L13.3381 6.79509L7.935 9.58178Z"
                            />
                        </svg>
                    </a>
                    <a
                        href="#"
                        class="fill-[#636363] duration-300 ease-in-out hover:fill-[#F3A45D]"
                    >
                        <svg
                            xmlns="http://www.w3.org/2000/svg"
                            width="24"
                            height="24"
                            viewBox="0 0 24 24"
                        >
                            <path
                                d="M12 3C13.1819 3 14.3522 3.23279 15.4442 3.68508C16.5361 4.13738 17.5282 4.80031 18.364 5.63604C19.1997 6.47177 19.8626 7.46392 20.3149 8.55585C20.7672 9.64778 21 10.8181 21 12C21 14.3869 20.0518 16.6761 18.364 18.364C16.6761 20.0518 14.3869 21 12 21C7.86 21 4.395 18.228 3.324 14.457L6.771 15.879C7.005 17.04 8.04 17.922 9.273 17.922C10.677 17.922 11.82 16.779 11.82 15.375V15.258L14.88 13.071H14.952C16.824 13.071 18.345 11.55 18.345 9.678C18.345 7.806 16.824 6.285 14.952 6.285C13.08 6.285 11.55 7.806 11.55 9.678V9.723L9.417 12.837L9.273 12.828C8.742 12.828 8.247 12.99 7.842 13.269L3 11.28C3.387 6.645 7.257 3 12 3ZM8.652 16.653C9.372 16.95 10.2 16.617 10.497 15.897C10.794 15.177 10.452 14.358 9.75 14.061L8.598 13.584C9.039 13.422 9.534 13.413 10.002 13.611C10.479 13.8 10.848 14.169 11.037 14.646C11.235 15.114 11.235 15.636 11.037 16.104C10.65 17.076 9.507 17.544 8.535 17.139C8.085 16.95 7.743 16.608 7.554 16.203L8.652 16.653ZM17.22 9.678C17.22 10.929 16.203 11.946 14.952 11.946C13.71 11.946 12.693 10.929 12.693 9.678C12.6918 9.38101 12.7494 9.08672 12.8625 8.81211C12.9756 8.5375 13.142 8.288 13.352 8.07799C13.562 7.86799 13.8115 7.70164 14.0861 7.58853C14.3607 7.47543 14.655 7.41781 14.952 7.419C16.203 7.419 17.22 8.436 17.22 9.678ZM13.26 9.678C13.26 10.614 14.016 11.379 14.961 11.379C15.897 11.379 16.653 10.614 16.653 9.678C16.653 8.742 15.897 7.977 14.961 7.977C14.016 7.977 13.26 8.742 13.26 9.678Z"
                            />
                        </svg>
                    </a>
                    <a
                        href="#"
                        class="fill-[#636363] duration-300 ease-in-out hover:fill-[#4c75a3]"
                    >
                        <svg
                            xmlns="http://www.w3.org/2000/svg"
                            width="24"
                            height="24"
                            viewBox="0 0 24 24"
                        >
                            <path
                                d="M14.763 3H9.237C4.197 3 3 4.197 3 9.237V14.763C3 19.803 4.197 21 9.237 21H14.763C19.803 21 21 19.803 21 14.763V9.237C21 4.197 19.803 3 14.763 3ZM17.535 15.843H16.221C15.726 15.843 15.573 15.438 14.7 14.547C13.908 13.8 13.566 13.692 13.377 13.692C13.116 13.692 13.035 13.764 13.035 14.142V15.321C13.035 15.636 12.936 15.834 12.099 15.834C10.713 15.834 9.174 14.988 8.094 13.431C6.465 11.145 6.024 9.417 6.024 9.075C6.024 8.886 6.087 8.706 6.465 8.706H7.788C8.121 8.706 8.247 8.85 8.373 9.21C9.021 11.1 10.101 12.72 10.542 12.72C10.713 12.72 10.785 12.639 10.785 12.225V10.29C10.74 9.408 10.263 9.327 10.263 9.012C10.263 8.85 10.389 8.706 10.596 8.706H12.657C12.936 8.706 13.035 8.85 13.035 9.192V11.793C13.035 12.072 13.152 12.171 13.242 12.171C13.404 12.171 13.548 12.072 13.845 11.766C14.79 10.713 15.465 9.084 15.465 9.084C15.555 8.895 15.699 8.715 16.05 8.715H17.337C17.733 8.715 17.823 8.922 17.733 9.201C17.571 9.966 15.969 12.225 15.987 12.225C15.843 12.45 15.789 12.549 15.987 12.81C16.122 12.999 16.581 13.395 16.887 13.746C17.445 14.385 17.877 14.916 17.994 15.285C18.093 15.654 17.913 15.843 17.535 15.843Z"
                            />
                        </svg>
                    </a>
                </div>
            </div>
            <div class="contact-section flex items-center gap-6 md:gap-7">
                <Link
                    href="#"
                    class="text-sm font-bold text-Orange duration-300 ease-in-out hover:opacity-80"
                >
                    Тикеты
                </Link>
                <Link href="/faq"
                    class="text-sm font-bold text-Orange duration-300 ease-in-out hover:opacity-80"
                >
                    Частые вопросы
                </Link>
            </div>
        </div>
    </MainLayout>
</template>

<script setup lang="ts">
import { onMounted } from 'vue';
import { Link } from '@inertiajs/vue3';
import { gsap } from 'gsap';
import MainLayout from '@/layouts/main.vue';

onMounted(() => {
    gsap.fromTo(
        '.contact-section',
        { y: 28, opacity: 0 },
        { y: 0, opacity: 1, duration: 0.45, stagger: 0.1, ease: 'power2.out' },
    );
});
</script>

<style></style>
